Revit 2027 API
BuiltInFailures.CurtainWallFailures.CannotSplitOldMullions Property
 Split does not work on curtain walls containing mullions created in Revit prior to version 4.0. You may delete the mullions, place them again, and then proceed with splitting the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSplitOldMullions { get; }
Public Shared ReadOnly Property CannotSplitOldMullions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSplitOldMullions {
	FailureDefinitionId^ get ();
}
static member CannotSplitOldMullions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace